app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `url`, `content`, `created_at`, `updated_at`) VALUES ('123', '', '', '2015-04-20 06:05:50', '2015-04-20 06:05:50')

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE `articles` SET `url` = 'good', `content` = 'bad', `updated_at` = '2015-04-20 06:08:17' WHERE `articles`.`id` = 1