app/controllers/media_controller.rb

  def create
    @medium = current_user.media.new(medium_params)

    respond_to do |format|
      if @medium.save
---
INSERT INTO `media` (`login_name`, `media_type`, `created_at`, `updated_at`) VALUES ('123', 1, '2015-04-20 06:43:20', '2015-04-20 06:43:20')

    def set_medium
      @medium = current_user.media.find(params[:id])
---
SELECT  `media`.* FROM `media` WHERE `media`.`id` = NULL LIMIT 1