app/controllers/sources_controller.rb

SELECT `sources`.* FROM `sources`
---
  def index
    @sources = Source.all

SELECT `sources`.* FROM `sources`
---
  def update_all
    Source.all.each &:create_articles

INSERT INTO `sources` (`name`, `url`, `created_at`, `updated_at`) VALUES ('123', 'http://123', '2015-04-20 06:57:20', '2015-04-20 06:57:20')
---
  def create
    @source = Source.new(source_params)

    respond_to do |format|
      if @source.save

DELETE FROM `sources` WHERE `sources`.`id` = 1
---
  def destroy
    @source.destroy

SELECT  `sources`.* FROM `sources` WHERE `sources`.`id` = 1 LIMIT 1
---
    def set_source
      @source = Source.find(params[:id])